[
    {
        "name": "Chicken Burger",
        "lowerCaseName": "chickenburger",
        "description": "Well seasoned chicken breast fillet between a fresh bun, garnished by fresh salad.",
        "mealType": "evening",
        "courseType": "main",
        "calories": 500,
        "ingredients": [
            "chicken",
            "bun",
            "lettuce",
            "tomato",
            "onion",
            "mayonnaise"
        ],
        "isTreat": false,
        "isDessert": false,
        "cost": "cheap",
        "timeToPrepare": "quick",
        "difficulty": "easy",
        "method": [
            "Preheat either with an over or a cast iron grill.",
            "Either flatten or butterfly a chicken breast fillet.",
            "Season the chicken well with your choice of spices. I recommend salt, pepper, garlic powder and paprika.",
            "Start cooking the chicken",
            "Start preparing your salad. Shred the lettuce and slice the tomatoes and onions. Add any other type of salad you want!",
            "Slice your bun in half whilst you wait. This is also a good time to clean up your chopping board and knife.",
            "Flip your chicken over once it is half-way cooked. Add more seasoning if you wish.",
            "Once your chicken has finished cooking, take it off the heat and leave it to rest.",
            "Use your chosen cooking appliance to toast your buns. Keep an eye on them to ensure they don't burn.",
            "Once your buns have toasted remove them from the heat and leave them to cool.",
            "Once cooled, start building your burger. Don't forget to add the mayonnaise when you finish."
        ],
        "leftovers": false
    },
    {
        "name": "Hot Dogs",
        "lowerCaseName": "hotdogs",
        "description": "Hot Dogs with Bacon Pieces and Creme Fraiche",
        "mealType": "evening",
        "courseType": "main",
        "calories": 500,
        "ingredients": [
            "hot dog",
            "bun",
            "bacon",
            "creme fraiche",
            "american mustard"
        ],
        "isTreat": false,
        "isDessert": false,
        "cost": "cheap",
        "timeToPrepare": "quick",
        "difficulty": "easy",
        "method": [
            "Preheat the oven.",
            "Start boiling the hot dogs in a pan.",
            "Place the bacon on a grill pan and place into the centre of the oven.",
            "Once the hot dogs are partly cooked remove them from the heat and leave them to dry.",
            "Place the hot dogs in a pan on high heat. Remember to turn them frequently.",
            "Remove the bacon from the oven and leave them to cool.",
            "Slice the buns down the middle and place them under the grill or in the frying pan to toast.",
            "When the bacon is cool, slice it into small pieces.",
            "Once the buns have slightly toasted, remove them from the heat and allow them to cool.",
            "When the hot dogs have a light char on them remove them from the heat.",
            "Start building! Place the hot dog in the bun, dollop some creme fraiche on top and sprinkle with your bacon pieces. Finish it off with some American mustard!"
        ],
        "leftovers": false
    },
    {
        "name": "Rocket & Parmesan Salad",
        "lowerCaseName": "rocketparmesansalad",
        "description": "A mixture of fresh rocket, crunchy parmsean and balsamic dressing.",
        "mealType": "evening",
        "courseType": "side",
        "calories": 50,
        "ingredients": [
            "rocket",
            "parmesan",
            "balsamic dressing"
        ],
        "isTreat": false,
        "isDessert": false,
        "cost": "medium",
        "timeToPrepare": "quick",
        "difficulty": "easy",
        "method": [
            "Fill a large serving dish with fresh rocket.",
            "Shave strips of parmesan from a wedge. Try to keep the pieces as big as possible.",
            "Sprinkle the parmsean over the rocket.",
            "Toss the rocket and parmesan to mix it all up.",
            "The parmesan will break up easily meaning it mixes in well.",
            "Drizzle over the balsamic dressing."
        ],
        "leftovers": false
    }
    ,
    {
        "name": "Club Sandwich",
        "lowerCaseName": "clubsandwich",
        "description": "Turkey, Bacon, Lettuce, Cheese & Tomato all packed between 3 slices of toast.",
        "mealType": "lunch",
        "courseType": "main",
        "calories": 400,
        "ingredients": [
            "bread",
            "turkey",
            "bacon",
            "cheese",
            "lettuce",
            "tomato"
        ],
        "isTreat": false,
        "isDessert": false,
        "cost": "medium",
        "timeToPrepare": "quick",
        "difficulty": "easy",
        "method": [
            "Preheat the oven.",
            "If you are using raw turkey, season it well with salt and pepper and place it in the oven.",
            "Place the bacon on a grill pan and place it in the oven.",
            "Make sure you have 3 slices of bread per person.",
            "Set the toaster to low and put the bread in. You want the toast to have cooled down by the time you're building the sandwich.",
            "Slice the tomatoes and lettuce.",
            "Grate some cheese.",
            "Remove the bacon from the oven and allow it to cool.",
            "When your turkey is cooked remove it from the oven and allow it to cool.",
            "Once cooled, slice your turkey into thin pieces.",
            "When everything is ready, start building your club sandwich.",
            "Start with a slice of toast. It's up to you whether to butter it or not.",
            "Place the turkey on top and then the lettuce and tomato.",
            "Then put another slice of toast on top.",
            "Place the bacon and cheese on top, and finish it off with another slice of toast.",
            "Cut the club sandwich diagonally into quarters. Line them up on a plate and enjoy!"
        ],
        "leftovers": false
    }
]
